Autodesk.Revit.DB.Structure.AnalyticalSupportChecking.CheckMemberSupports(Autodesk.Revit.DB.Document,System.String)
Check if the document contains unsupported Structural Elements.
Remarks:
Existence of unsupported Elements will not affect the return value.
Reporting of unsupported Structural Elements will be done via Warnings.
This should be run from within a transaction.
document:
Document in which to perform Analytical Support Check.
progressIndicatorText:
Text to display on progress indicator.
Returns:
True if the support check succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.AnalyticalSupportChecking
Utilities that allow for detection of incorrect or incomplete analytical supports.